app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = 3 LIMIT 1
UPDATE "events" SET "updated_at" = '2025-03-07 14:45:09.366148', "description" = 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry''s standard dummy text ever since the 1500' WHERE "events"."id" = 10
---
  def update
    @event = Event.find(params[:id])
    @event.update(event_params)

INSERT INTO "events" ("name", "location", "price", "created_at", "updated_at", "starts_at", "description") VALUES ('Docker Conf', 'Bangkok, TH', 0.0, '2025-03-07 14:03:27.989030', '2025-03-07 14:03:27.989030', '2025-03-10 14:02:00', 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry''s standard dummy text ever since the 1500s') RETURNING "id"
---
  def create
    @event = Event.new(event_params)
    @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = 10 LIMIT 1
DELETE FROM "events" WHERE "events"."id" = 8
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy!